// movies — двовимірний масив: кожен рядок — один фільм.
// Індекси всередині рядка: 
// [0] - назва, 
// [1] - картинка, 
// [2] - опис, 
// [3] - оцінка

const movies = [
	['Пірати Карибського моря: Прокляття Чорної Перлини', '1.jpg', 'Американський фантастичний пригодницький фільм 2003 року...', 8.1],
	['Пірати Карибського моря: Скриня мерця', '2.jpg', 'Американський пригодницький фільм 2006 року компанії...', 7.4],
	['Пірати Карибського моря: На краю світу', '3.jpg', 'Американський пригодницький фільм 2007 року...', 7.1],
	['Пірати Карибського моря: На дивних берегах', '4.jpg', 'Американська пригодницька стрічка 2011 року...', 6.6],
	['Пірати Карибського моря: Помста Салазара', '5.jpg', 'Американський пригодницький фільм-фентезі...', 6.5]
];

console.log('count: ', movies.length);
console.log('first name: ', movies[0][0]);

for (let i = 0; i < movies.length;  i++) {
    console.log(i, '---------------------');
    for (let j = 0;j < movies[i].length; j++) {
        if (j !== 2) console.log(movies[i][j]);
    }
}

let noAnswerd = true;
// 2 tasl
while (noAnswerd) {
    console.log(noAnswerd);

    const userChois = prompt('swich theme: white -1 / dark -2');

    if(userChois === null)
    if(userChois == null) {

    }
}
